Repository: zipf/perldoc-es
Catalog: memory/_reference/padre-es_work.tmx
Source language: en_us
Languages: es_es

source: In order to configure and enable them go to Plug-ins -> Plug-in Manager
es_es: Para configurarlos y habilitarlos, vaya a Complementos -> Administrador de complementos

source: Incremental search seen at the bottom of the window
es_es: Muestra la búsqueda incremental en la parte inferior de la ventana

source: Info
es_es: Información

source: Insert From File...
es_es: Insertar desde archivo...

source: Insert Snippit
es_es: Insertar fragmento

source: Insert Special Value
es_es: Insertar valor especial

source: Jump to current execution line
es_es: Saltar a la línea de ejecución actual

source: Jump to the matching opening or closing brace: {, }, (, )
es_es: Salta a la llave o el paréntesis de apertura o cierre correspondiente: {, }, (, )

source: Jumpt to the code that triggered the next error
es_es: Salta al código que desencadenó el siguiente error

source: Key binding name
es_es: Nombre de asociación de teclas

source: Lexically Rename Variable
es_es: Cambiar nombre de variable en ámbito léxico

source: Like pressing ENTER somewhere on a line but use the current position as ident for the new line.
es_es: Como presionar Entrar en algún punto de la línea, pero usando la posición actual como sangría para el carácter de nueva línea.

source: Line No
es_es: Nº de línea

source: Line number between (1-%s):
es_es: Número de línea entre (1-%s):

source: Lines: %d
es_es: Líneas: %d

source: List all the breakpoints
es_es: Mostrar todos los puntos de interrupción

source: List of new plug-ins:
es_es: Lista de complementos nuevos:

source: Maintenance
es_es: Mantenimiento

source: Mark selection end
es_es: Marcar fin de selección

source: Mark selection start
es_es: Marcar inicio de selección

source: Match at least n but not more than m times
es_es: Detectar al menos n veces, pero no más de m

source: Match exactly n times
es_es: Detectar exactamente n veces

source: Move here
es_es: Mover aquí

source: Move to trash
es_es: Mover a la papelera

source: Multi-line (%s)
es_es: Multilínea (%s)

source: Navigate
es_es: Navegar

source: New Subroutine Name
es_es: Nombre de subrutina nueva

source: New installation survey
es_es: Nueva encuesta de instalación

source: New module
es_es: Nuevo módulo

source: New...
es_es: Nuevo...

source: Newline same column
es_es: Carácter de nueva línea en la misma columna

source: Newline type: %s
es_es: Tipo de nueva línea: %s

source: No Build.PL nor Makefile.PL found
es_es: No se encontró un archivo Build.PL o Makefile.PL

source: No diagnostics available for this error!
es_es: No hay ningún diagnóstico disponible para este error.

source: No diagnostics available for this error.
es_es: No hay ningún diagnóstico disponible para este error.

source: No execution mode was defined for this document
es_es: No se ha definido un modo de ejecución para este documento

source: No matches found
es_es: No se encontró ninguna coincidencia

source: Norwegian (Norway)
es_es: Noruego (Noruega)

source: Not a valid search
es_es: La búsqueda no es válida

source: Nothing selected. Enter what should be opened:
es_es: No hay nada seleccionado. Indique qué es lo que desea abrir:

source: Offer completions to the current string. See Preferences
es_es: Ofrece sugerencias para completar la cadena actual. Ver Preferencias.

source: Open
es_es: Abrir

source: Open In Command Line
es_es: Abrir en línea de comandos

source: Open In File Browser
es_es: Abrir en el navegador de archivos

source: Open Resource
es_es: Abrir recurso

source: Open Resource...
es_es: Abrir recurso...

source: Open Session
es_es: Abrir sesión

source: Open With Default System Editor
es_es: Abrir con el editor predeterminado del sistema

source: Open a document and copy the content of the current tab
es_es: Abre un documento y copia el contenido de la pestaña actual

source: Open perlmonks.org, one of the biggest Perl community sites in your default web browser
es_es: Abre perlmonks.org, uno de los sitios principales de la comunidad Perl, en el navegador web predeterminado

source: Open the Padre live support in your default web browser and chat to others who may help you with your problem
es_es: Abre el soporte en línea de Padre en el navegador web predeterminado donde podrá charlar con otros usuarios que pueden ayudarle

source: Open the Perl live support in your default web browser and chat to others who may help you with your problem
es_es: Abre el soporte en línea de Perl en el navegador web predeterminado donde podrá charlar con otros usuarios que pueden ayudarle

source: Open the Perl/Win32 live support in your default web browser and chat to others who may help you with your problem
es_es: Abre el soporte en línea de Perl/Win32 en el navegador predeterminado donde podrá charlar con otros usuarios que pueden ayudarle

source: Other Open Source
es_es: Otro (Open Source)

source: Other Unrestricted
es_es: Otro (sin restricciones)

source: Perl Distribution (Module::Starter)
es_es: Distribución Perl (Module::Starter)

source: Perl Distribution (New)...
es_es: Distribución de Perl (nueva)...

source: Perl filter
es_es: Filtro en Perl

source: Pick &directory
es_es: Elegir &directorio

source: Pl&ugins
es_es: &Complementos

source: Please choose a different name.
es_es: Elija otro nombre.

source: Please click on 'Plugins/Perl6/Maintenance' and then 'Cleanup STD Lex Cache' and then re-open the file.
es_es: Haga clic en 'Plugins/Perl6/Maintenance' primero y después en 'Cleanup STD Lex Cache'; a continuación, vuelva a abrir el archivo.

source: Please enter a name for the new subroutine
es_es: Escriba un nombre para la nueva subrutina

source: Positive integer
es_es: Entero positivo

source: Preview:
es_es: Vista previa:

source: Project directory %s does not exist (any longer).
es_es: El directorio del proyecto %s ya no existe.

source: Project-Id-Version: 0.69 Report-Msgid-Bugs-To: POT-Creation-Date: 2011-02-15 21:36+1100 PO-Revision-Date: 2010-12-04 16:23+0100 Last-Translator: Claudio Ramirez <padre.claudio@apt-get.be> Language-Team: Spanish Language: MIME-Version: 1.0 Content-Type: text/plain; charset=UTF-8 Content-Transfer-Encoding: 8bit Plural-Forms: nplurals=2; plural=(n != 1); X-Poedit-Language: Spanish
es_es: Project-Id-Version: 0.69 Report-Msgid-Bugs-To: POT-Creation-Date: 2011-02-15 21:36+1100 PO-Revision-Date: 2010-12-04 16:23+0100 Last-Translator: Enrique Nell <blas.gordon@gmail.com> Language-Team: Spanish Language: MIME-Version: 1.0 Content-Type: text/plain; charset=UTF-8 Content-Transfer-Encoding: 8bit Plural-Forms: nplurals=2; plural=(n != 1); X-Poedit-Language: Spanish

source: Project-Id-Version: Padre-Plugin-Catalyst Report-Msgid-Bugs-To: POT-Creation-Date: 2010-12-11 00:36+0100 PO-Revision-Date: Last-Translator: Enrique Nell <blas.gordon@gmail.com> Language-Team: spanish latino Language: MIME-Version: 1.0 Content-Type: text/plain; charset=iso-8859-1 Content-Transfer-Encoding: 8bit
es_es: Project-Id-Version: Padre-Plugin-Catalyst Report-Msgid-Bugs-To: POT-Creation-Date: 2010-12-11 00:36+0100 PO-Revision-Date: Last-Translator: Enrique Nell <blas.gordon@gmail.com> Language-Team: spanish Language: MIME-Version: 1.0 Content-Type: text/plain; charset=UTF-8 Content-Transfer-Encoding: 8bit

source: Project-Id-Version: Padre-Plugin-Perl6 Report-Msgid-Bugs-To: POT-Creation-Date: 2010-12-10 11:21+0100 PO-Revision-Date: Last-Translator: Bruno Vecchi <vecchi.v@gmail> Language-Team: Bruno Vecchi <vecchi.b@gmail.com> Language: MIME-Version: 1.0 Content-Type: text/plain; charset=UTF-8 Content-Transfer-Encoding: 8bit
es_es: Project-Id-Version: Padre-Plugin-Perl6 Report-Msgid-Bugs-To: POT-Creation-Date: 2010-12-10 11:21+0100 PO-Revision-Date: Last-Translator: Enrique Nell <blas.gordon@gmail> Language-Team: Enrique Nell <blas.gordon@gmail.com>, Bruno Vecchi <vecchi.b@gmail.com> Language: MIME-Version: 1.0 Content-Type: text/plain; charset=UTF-8 Content-Transfer-Encoding: 8bit

source: Prompt for a replacement variable name and replace all occurrance of this variable
es_es: Pregunta el nuevo nombre de variable y sustituye todas las instancias de esta variable

source: Proprietary/Restrictive
es_es: Comercial/Con restricciones

source: Quick Find
es_es: Búsqueda rápida

source: Quit Debugger
es_es: Salir del depurador

source: Reading items. Please wait
es_es: Leyendo elementos. Espere...

source: Reading items. Please wait...
es_es: Leyendo elementos. Espere...

source: Refac&tor
es_es: &Refactorizar

source: Refactor...
es_es: Refactorizar...

source: Regex editor
es_es: Editor de expresiones regulares

source: Related Editor Has been Closed
es_es: Se ha cerrado un editor relacionado

source: Reload Some Dialog...
es_es: Volver a cargar algunos...

source: Reload...
es_es: Volver a cargar..

source: Remove breakpoint
es_es: Quitar punto de interrupción

source: Rename / Move
es_es: Cambiar nombre / Mover

source: Rename Variable...
es_es: Cambiar nombre de variable...

source: Replacement
es_es: Sustitución

source: Run Script (debug info)
es_es: Ejecutar script (info. de depuración)

source: Run the current test if the current document is a test. (prove -bv)
es_es: Ejecuta el test actual si el documento actual es un test. (prove -bv)

source: Run till Breakpoint
es_es: Ejecutar hasta un punto de interrupción

source: Run till breakpoint
es_es: Ejecutar hasta un punto de interrupción

source: Run to cursor
es_es: Ejecutar hasta el cursor

source: Save &As
es_es: Guardar c&omo

source: Save Session
es_es: Guardar sesión

source: Save session automatically
es_es: Guardar sesión automáticamente

source: Select a Date, Filename or other value and insert at the current location
es_es: Permite seleccionar una fecha, un nombre de archivo u otro valor, e inserta dicho valor en la ubicación actual

source: Select a session. Close all the files currently open and open all the listed in the session
es_es: Permite seleccionar una sesión, cierra todos los archivos abiertos actualmente y abre todos los archivos de la sesión

source: Select all
es_es: Seleccionar todo

source: Select directory
es_es: Seleccionar directorio

source: Select files to reload:
es_es: Seleccione los archivos que desea volver a cargar:

source: Set Bookmark:
es_es: Establecer marcador:

source: Set Breakpoint
es_es: Establecer punto de interrupción

source: Set breakpoint
es_es: Establecer punto de interrupción

source: Set the focus to be the functions window
es_es: Establece el foco en la ventana de funciones

source: Set the focus to be the main editor window
es_es: Establece el foco en la ventana principal del editor

source: Set the focus to be the outline window
es_es: Establece el foco en la ventana de esquema

source: Set the focus to be the output window
es_es: Establece el foco en la ventana de resultados

source: Set the focus to be the syntax check window
es_es: Establece el foco en la ventana de comprobación de sintaxis

source: Set the focus to be the todo window
es_es: Establece el foco en la ventana de tareas pendientes

source: Setup a skeleton Perl distribution
es_es: Configura una estructura de distribución de Perl

source: Setup a skeleton Perl distribution using Module::Starter
es_es: Configura una estructura de distribución Perl con Module::Starter

source: Shorten the common path in window list?
es_es: Acortar la ruta común de la lista de ventanas

source: Show Command Line
es_es: Mostrar línea de comandos

source: Show Directory Tree
es_es: Mostrar árbol de directorios

source: Show Error List
es_es: Mostrar lista de errores

source: Show Errors
es_es: Mostrar errores

source: Show Project Browser
es_es: Mostrar Navegador de proyectos

source: Show Stack Trace
es_es: Mostrar seguimiento de la pila

source: Show Value
es_es: Mostrar valor

source: Show Value Now
es_es: Mostrar valor ahora

source: Show a window with a directory browser of the current project
es_es: Muestra una ventana con un árbol de directorios del proyecto actual

source: Show as ...
es_es: Mostrar como...

source: Show as decimal
es_es: Mostrar como decimal

source: Show as hexa
es_es: Mostrar como hexadecimal

source: Show error message
es_es: Mostrar mensaje de error

source: Show hidden files
es_es: Mostrar archivos ocultos

source: Show only files that don't match
es_es: Mostrar sólo archivos no coincidentes

source: Show the ASCII values of the selected text in hexa in the output window
es_es: Muestra los valores ASCII del texto seleccionado como números hexadecimales en la ventana de resultados

source: Show the about-Padre information
es_es: Muestra información acerca de Padre

source: Show the list of errors received during execution of a script
es_es: Muestra la lista de errores encontrados al ejecutar un script

source: Show the value of a variable.
es_es: Muestra el valor de una variable.

source: Simulate Crashing Bg Task
es_es: Simular bloqueo de tarea de segundo plano

source: Single-line (%s)
es_es: Una línea (%s)

source: Size on disk: %s
es_es: Tamaño en disco: %s

source: Skip CVS/.svn/.git/blib folders
es_es: Omitir carpetas CVS/.svn/.git/blib

source: Skip VCS files
es_es: Omitir archivos de VCS

source: Skip hidden files
es_es: Omitir archivos ocultos

source: Snippit:
es_es: Fragmento de código:

source: Step In
es_es: Paso a paso por instrucciones

source: Step Out
es_es: Paso a paso hasta salir

source: Step Over
es_es: Paso a paso por funciones

source: Stop execution
es_es: Detener ejecución

source: Switch document type to %s
es_es: Cambia el tipo de documento a %s

source: Switch highlighting colors to %s style
es_es: Cambia el resaltado de colores al estilo %s

source: Switch menus to %s
es_es: Cambia el idioma de la interfaz a %s

source: Switch menus to the default %s
es_es: Cambia el idioma de la interfaz al predeterminado del sistema, %s

source: TAB display size (in spaces):
es_es: Mostrar tamaño de tabulación (en espacios)

source: Term:
es_es: Término:

source: The file %s you are trying to open is over the arbitrary file size limit of Padre which is currently %s.
es_es: El archivo %s que intenta abrir supera el límite de tamaño de archivo de Padre, que actualmente es %s.

source: The following tasks are currently executing in the background:
es_es: Se están ejecutando las siguientes tareas en segundo plano:

source: The same as Perl itself
es_es: La misma que Perl

source: This is fatal and will cause problems, please close or save-as this file unless you know what you are doing.
es_es: Este error es grave y va a provocar problemas. Si no está seguro de lo que debe hacer, cierre o guarde este archivo.

source: This requires an installed Wx::Scintilla and a Padre restart
es_es: Esto requiere instalar Wx::Scintilla y reiniciar Padre

source: This system is running Catalyst version
es_es: Versión de Catalyst instalada en este sistema:

source: Timeout:
es_es: Tiempo de espera:

source: To use the Catalyst development tools including catalyst.pl and the generated script/myapp_create.pl you need Catalyst::Helper, which is part of the Catalyst-Devel distribution. Please install this via a vendor package or by running one of -
es_es: Para usar las herramientas de desarrollo de Catalyst, como catalyst.pl o el archivo script/myapp_create.pl generado, necesita Catalyst::Helper, que forma parte de la distribución Catalyst-Devel. Instálelo a través de un paquete de un proveedor o ejecute uno de los comandos siguientes:

source: Tree listing
es_es: Lista de árbol

source: Type in a filter to select a file
es_es: Permite especificar un filtro para seleccionar un archivo

source: Use Splash Screen?
es_es: Activar pantalla de bienvenida

source: View Release Notes
es_es: Ver las notas de la versión

source: We found several new plug-ins. In order to configure and enable them go to Plug-ins -> Plug-in Manager List of new plug-ins:
es_es: Se han detectado varios complementos nuevos. Para configurarlos y habilitarlos, vaya a Complementos -> Administrador de complementos Lista de complementos nuevos:

source: Web server appears to be running. Launch web browser now?
es_es: Parece que el servidor web se está ejecutando. ¿Desea iniciar el navegador web ahora?

source: When typing { insert a closing } automatically
es_es: Al escribir una llave de apertura ({) inserta una llave de cierre (}) automáticamente

source: Word-Wrap File
es_es: Ajustar líneas de archivo

source: Words: %s
es_es: Palabras: %s

source: Wx::Perl::ProcessStream is version %s which is known to cause problems. Get at least 0.20 by typing cpan Wx::Perl::ProcessStream
es_es: Se sabe que la versión %s de Wx::Perl::ProcessStream causa problemas. Debe usar como mínimo la versión 0.20. Para ello, escriba cpan Wx::Perl::ProcessStream

source: You still have a running process. Do you want to kill it and exit?
es_es: Se está ejecutando un proceso. ¿Desea eliminarlo y salir?

source: folder
es_es: carpeta

source: pip is unexpectedly not installed
es_es: No se esperaba que pip (programa de instalación de distribuciones Perl) no estuviera instalado.

source: which are special chars on most computers. Skip?
es_es: que tiene un significado especial en la mayoría de los sistemas. ¿Desea omitirlo?
